Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ངའི་ཡུལ་ན་གནས་པའི་སེམས་ཅན་འདི་དག་ཀྱང་ཕལ་ཆེར་སྲོག་གཅོད་པ་བྱེད་པ། མ་བྱིན་པར་ལེན་པ། འདོད་པས་ལོག་པར་གཡེམ་པ། བརྫུན་དུ་སྨྲ་བ། ཕྲ་མ་ཅན་ཚིག་བརླང་བོར་སྨྲ་བ། བྱུང་རྒྱལ་དུ་བརྗོད་པ། ཆགས་སེམས་དང་ལྡན་པ། གནོད་སེམས་ཅན། ལོག་པར་ལྟ་བ། སྡིག་པའི་ལས་བྱེད་པ། ཁྲོ་ཞིང་གཏུམ་པ། བབ་རྒྱལ་ཅན། མི་དགེ་བའི་ལས་ཀྱི་བྱ་བ་སྣ་ཚོགས་དང་ལྡན་པ་དག་སྟེ།
en: Noble one, most of the inhabitants of my kingdom kill, steal, practice sexual misconduct, lie, slander, abuse, indulge in idle talk, are avaricious, are malicious, hold false views, commit bad actions, and are fierce, aggressive, and cruel, and they maintain a behavior consisting of all kinds of bad actions.

source: དེ་དག་ནི་རྣམ་པ་གཞན་གྱིས་སྡིག་པའི་སྤྱོད་པ་ལས་བཟློག་པ་དང་། དགག་པ་དང་། བསྟན་པར་མི་ནུས་ཏེ།
en: “There is no other way to instruct them to turn away, to desist, from that sinful behavior.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ང་ནི་སེམས་ཅན་འདི་དག་གདུལ་བ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཤིན་ཏུ་དུལ་བར་བྱ་བ་དང་། ཕན་པ་ལ་དགོད་པར་བྱ་བའི་ཕྱིར། སྙིང་རྗེ་ཆེན་པོ་མདུན་དུ་བྱས་ཏེ། གསོད་པའི་གཤེད་མ་སྤྲུལ་པ་རྣམས་གསད་པའི་མྱིར་སྤྲུལ་པ་རྣམས་ལ།
en: “Noble one, in order to guide, ripen, control, and benefit these beings, motivated by great compassion I manifest the illusory images of executioners, through which I execute the illusory images of the condemned.

source: གསོད་དུ་གཟུང་པ་དང་། ཆད་པས་གཅོད་པའི་མི་སྤྲུལ་པ་རྣམས་མི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་སྤྱོད་པར་སྤྲུལ་པའི་མྱི་རྣམས་ལ་ཆད་པ་སྣ་ཚོགས་ཀྱིས་གཅོད་དུ་གཟུད་པ་དང་། རྐ་ལག་དང་སྣ་དང་རྣ་བ་དང་། ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་བཅད་པ་ལས་བྱུང་བའི་སྡུག་བསྔལ་མི་བཟད་པ་ཉམས་སུ་ཚོར་བར་གྱུར་བ་ལྟ་བུ་དག་ཀྱང་ཡོངས་སུ་སྟོན་པ་བྱེད་དེ།
en: I make the illusions of those who punish and execute in various ways the illusions of those who have followed a path of bad actions. I also emanate those who experience the unendurable sufferings of having their feet, hands, noses, ears, limbs, smaller parts, and heads cut off.

source: དེ་མཐོང་ནས་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་དེ་དག་ཉེས་པ་གཏོང་ཞིང་སྐྱོ་བའི་ཤུགས་ཐོབ་པར་འགྱུར་རོ། །འཇིགས་པ་སྐྱེ་ཞིང་བག་ཚ་བ་སྐྱེ་བར་འགྱུར་རོ།
en: When the beings who live in my realm see that, they become distressed, afraid, and terrified.

source: །དེ་དག་སྡིག་པའི་ལས་བྱེད་པ་རྣམས་གཏོང་ཞིང་བག་བྱེད་པར་འགྱུར་རོ།
en: After that, they are careful to avoid committing bad actions.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་སེམས་ཅན་འདི་དག་ཐབས་དེས་ཉེས་པ་སྟོང་ཞིང་འཇིགས་པའི་སེམས་དང་ལྡན་པ་དང་། སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་ཤེས་ནས། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལས་བཟློག་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་བྱས་ནས་དགའ་ཞིང་བདེ་བའི་མཐར་ཕྱིན་པ། སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བདེ་བ་ལ་དགོད་པ་བྱེད་ཀྱི།
en: “Noble one, when in that way I have used that method and see that these beings are distressed, terrified, and alarmed, I then turn them away from the path of the ten bad actions, cause them to possess the path of the ten good actions, and establish them in the path to omniscience, which is the ultimate attainment of joy and happiness and the cessation of all suffering.

source: རིགས་ཀྱི་བུ་ང་ནི་ལུས་དང་ངག་གམ། ཡིད་ཀྱིས་ཀྱང་སེམས་ཅན་སུ་ལའང་ཅོ་མི་འདྲི།
en: “Noble one, I do not cause harm to any being with my body, speech, or mind.

source: ཐོ་མི་འཚམ་མོ། རིགས་ཀྱི་བུ་ང་ནི་ཕྱི་མའི་མཐའི་མནར་མྱེད་པའི་སྡུག་བསྔལ་གྱིས་བགྲིངས་ཤེས་པ་སྟེ། བྱོལ་སོང་གི་སྐྱེ་གནས་གླེན་པའི་ཁམས་སུ་གཏོགས་པ་ལས་ཀྱང་ཆུང་ངུ་ན། རྩྭའི་རྩེ་མོས་བལྟ་བའི་སྲོག་ཆགས་ཕྲེའུ་འགའ་ལ་ཡང་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་དུ་ཡང་སྡུག་བསྔལ་བར་བྱ་བར་མྱི་དགའ་ན། ཞིང་དུ་གྱུར་ཅིང་དགེ་བའི་ལས་ཀྱི་ལམ་བསྐྱེད་པར་ནུས་པའི་མི་ལྟ་ཞིག་ཅི་སྨོས།
en: “Noble one, I would wander in the most extreme suffering of the Avīci hell, but I would not even once have arise in my mind the wish to cause harm to even the smallest being, a minute insect seen on the tip of a blade of grass, existing in the realm of stupidity, which is rebirth as an animal, let alone to a human being in my realm, who has the ability to develop the path of good actions.

source: རིགས་ཀྱི་བུ་ང་ནི་རྨི་ལམ་ན་ཡང་མི་དགེ་བའི་ཆོས་ཡོངས་སུ་རྒྱུ་བ་མྱི་བསྐྱེད་ན། ཆེད་དུ་བསམས་ཏེ་ལྟ་སྨོས་རེ་སྐན།
en: “Noble one, I do not generate the qualities of a bad action in my dreams, let alone deliberately.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྱུ་མའི་རྣམ་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the attainment of illusions

source: ངས་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པ། སྲིད་པ་དང་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་སྒྱུ་མའི་རྣམ་པ་ཁོང་དུ་ཆུད་པ་སྤྲུལ་པ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་བྱུང་བ། གཟུགས་བརྙན་ལྟ་བུའི་འཇིག་རྟེན་ཐམས་ཅད་རྣམ་པར་རིག་པ། རྨི་ལམ་ལྟ་བུའི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པ། ཐོགས་པ་མེད་པའི་སྒོའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ལ་རྗེས་སུ་ཞུགས་པ། མྱིག་འཕྲུལ་ལྟ་བུའི་སྤྱོད་པའི་དྲ་བ་རྟོགས་པར་གྱུར་པ། ཡེ་ཤེས་བསྒྲིབས་པ་མེད་པའི་སྤྱོད་ཡུལ་གྱི་ཡུལ་དང་ལྡན་པ། ཀུན་ཏུ་ཡང་དག་པར་གཞོལ་བའི་ཏིང་ངེ་འཛིན་གྱི་ལམ་གྱིས་བྱུང་བ། ཀློང་ཀུན་ཏུ་འཁྱིལ་པའི་རྒྱུད་ཀྱི་གཟུགས་ལ་དབང་བསྒྱུར་བ། སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་གྱི་ཡུལ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who have attained the patience of the birthlessness of phenomena, who have realized that all states of existence are illusions, who have given rise to the bodhisattva conduct that is like an illusion, who know that all worlds are like reflections, who have realized that the nature of phenomena is like a dream, who follow the way of the unimpeded gateway to the realm of the Dharma, who have understood that the net of conduct is like a magical illusion, who have the scope of the range of unobscured wisdom, who have set forth on the path of unobscured samādhi, who have gained the power of retention that has an infinite capacity, and who comprehend the scope of the range of activity of the buddhas?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། གྲོང་ཁྱེར་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Suprabha

source: དེ་ན་རྒྱལ་པོ་འོད་ཆེན་པོ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a king by the name of Mahāprabha.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པོ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་མྱེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: རྒྱལ་པོ་མེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་རྒྱལ་པོ་མེའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of King Anala, circumambulated King Anala many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from King Anala.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཡེ་ཤེས་སྒྱུ་མ་དེ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་།
en: Mahāprabha Sudhana, the head merchant’s son, remembered that illusion of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ།
en: He contemplated the bodhisattva’s liberation that had the form of illusion. He examined the illusory aspect of the nature of phenomena.

source: སྒྱུ་མའི་རྣམ་པ་དེ་ལ་བསམ་པ་དང་། ཆོས་ཉིད་སྒྱུ་མའི་རྣམ་པ་དེ་ལ་རབ་ཏུ་བརྟག་པ་དང་། ལས་ཀྱི་སྒྱུ་མ་མཉམ་པ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཆོས་ཀྱི་སྒྱུ་མ་མཉམ་པ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་། ཆོས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྤྲུལ་པ་མཉམ་པ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡེ་ཤེས་ལས་བྱུང་བའི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། སྨོན་ལམ་གྱི་སྒྱུ་མའི་རྣམ་པ་མཐའ་ཡས་པ་མངོན་པར་བསྒྲུབ་པ་དེ།
en: He comprehended the equality of the illusions of actions. He reflected on the equality of the illusions of phenomena. He comprehended the equality of the emanations that are ripened by the Dharma. He followed the inconceivable appearances that arise from wisdom. He accomplished the accomplishment of the illusions of infinite prayer.

source: མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་། སྤྱོད་པ་སྤྲུལ་པའི་ཆོས་ཉིད་ཆགས་པ་མྱེད་པ་དེ་རྣམ་པར་སྦྱོང་བར་བྱ་བ་དང་། དུས་གསུམ་གྱི་སྒྱུ་མའི་རྣམ་པའི་མཚན་ཉིད་དེ་ཡང་རྣམ་པར་དབྱེ་བར་བྱེད་ཅིང་།
en: He purified the unimpeded conduct that has the true nature of an illusory manifestation. He analyzed the three times as having the characteristics of being composed of illusions.

source: མཐར་གྱིས་ཡུལ་ནས་ཡུལ་དུ་དྲི་བ་དང་། ཀུན་ཏུ་བཙལ་བ་དང་། རྗེས་སུ་རྣམ་པར་ལྟ་བུ་བྱེད་ཅིང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་དང་ལམ་དང་། སྨན་ལྗོངས་དང་། ཐང་དང་། ཐག་ཐུག་དང་། ཁལ་ཁོལ་དང་། རི་དང་རི་སུལ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་གནས་ཐམས་ཅད་དུ་ཡོངས་སུ་སྐྱོ་བ་མྱེད་པའི་སེམས་དང་ལུས་ལ་དུ་བ་མེད་པར་ཚོལ་ཚོལ་ཏེ།
en: In one land after another, he questioned, searched, and looked around, seeking without weariness of the mind or exhaustion of the body throughout all the main and intermediate directions, roads, valleys, and plains, even and uneven ground, wet lands and dry lands, mountains and caves, villages and towns, markets, lands, kingdoms, and capitals.

source: གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོའི་ཉེན་ཀོར་ཞིག་ཏུ་ཕྱིན་པ་ན། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བཞུགས་ཤེས་དྲིས་ན།
en: He reached the vicinity of the city of Suprabha and asked, “Where is King Mahāprabha?”

source: དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་འདི་རེ་འདི་ནི་གྲོང་ཁྱེར་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: Many people told him, “Noble one, that over there is the city named Suprabha

source: འདི་ན་རྒྱལ་པོ་འོད་ཆེན་པོ་བཞུགས་སོ་ཞེས་ནས།
en: King Mahāprabha lives there.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་གང་ན་བ་དེར་ཕྱིན་ནས། གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་མཐོང་ངོ་།
en: Then Sudhana, the head merchant’s son, approached the city of Suprabha and saw the great city of Suprabha

source: །མཐོང་ནས་ཀྱང་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Seeing it, he was overjoyed, pleased, content, and happy.

source: འདི་སྙམ་དུ་བསམས་སོ། །འདི་ན་བདག་གི་དགེ་བའི་བཤེས་གཉེན་བཞུགས་པ་ལྟ་སྟེ།
en: He thought, “I am looking at the place where my kalyāṇamitra lives.

source: དེ་རིང་ནི་དགེ་བའི་བཤེས་གཉེན་དེ་ཡང་མཐོང་བར་འགྱུར་རོ།
en: Today I will see the kalyāṇamitra.

source: །དེ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་ཐོས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རོལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བརྩམས་པ་ཆེན་པོ་མཐར་དབྱུང་བ་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་འང་ཐོས་པར་འགྱུར་རོ་ཞེས་དེ་ལྟར་བསམ་པ་ཡིད་ལ་བྱེད་ཅིང་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་དེ་ལ་བལྟས་ན།
en: I will hear from him the bodhisattva conduct, and I will hear from him the inconceivable gateways through which the bodhisattva sets forth, the inconceivable true nature of a bodhisattva, the inconceivable qualities of a bodhisattva, the inconceivable range of activity of a bodhisattva, the inconceivable powerful supremacy of a bodhisattva, the inconceivable samādhis practiced by a bodhisattva, the inconceivable liberations enjoyed by a bodhisattva, and the inconceivable pure fulfillment of the undertakings of a bodhisattva.” Concentrating on those thoughts, Sudhana approached the city of Suprabha , and having arrived he looked at the city of Suprabha

source: གསེར་དང་དངུལ་དང་བཻཌཱུརྱ་དང་། ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་། ཨ་སྨ་གར་བྷ་དང་། མུ་ས་ར་གལ་པ་དང་། རིན་པོ་ཆེ་འདི་བདུན་གྱིས་ཤིན་ཏུ་བཟང་ཞིང་བལྟ་ན་མཛེས་པ། རིན་པོ་ཆེའི་འོབས་ཟབས་སུ་ཟབ་པ། ཆུས་གང་བ་གཞི་གསེར་གྱི་གྲམ་པས་གང་བ། ལྷ་རྫས་ཀྱི་ཨུཏྤ་ལ་དང་། པདྨོ་དང་། ཀུ་མུད་དང་། བུནྡ་རི་ཀས་ཀུན་ནས་ཡོག་པ། དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་འདམ་དང་། ལུ་མས་འཁོར་བ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ།
en: It was encircled by seven wonderful and beautiful moats that were trenches of the seven precious materials—gold, silver, beryl, crystal, red pearls, emeralds, and white coral—filled with water, with a layer of gold sand at their bottoms, their surfaces covered with divine blue lotuses, red lotuses, night lotuses, and white lotuses and the water made turbid with yellow sandalwood mud.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ།
en: It was encircled by seven rows of palm trees made of the seven precious materials.

source: རྡོ་རྗེ་རིན་པོ་ཆེའི་ར་བ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ། འདི་ལྟ་སྟེ།
en: It was encircled by seven walls made of diamonds:

source: སེང་གེ་ཡིད་དུ་འོང་བའི་རྡོ་རྗེའི་ར་བ་དང་། རྡོ་རྗེ་གཞན་གྱིས་ཐུབ་པ་མེད་པའི་ར་བ་དང་། འབུག་པའི་ངང་ཚུལ་གྱི་རྡོ་རྗེའི་ར་བ་དང་། ཐུབ་པར་དཀའ་བའི་ངང་ཚུལ་གྱི་རྡོ་རྗེའི་ར་བ་དང་། རྡོ་རྗེ་བརྟན་པ་ཆགས་པ་མེད་པའི་ར་བ་དང་། རྡོ་རྗེའི་འོད་གཟེར་དྲ་བའི་སྙིང་པོའི་ར་བ་དང་། རྡུལ་དང་བྲལ་བའི་ཁ་དོག་གི་རྒྱན་གྱི་རྡོ་རྗེའི་ར་བས་ཡོངས་སུ་བསྐོར་བ་སྟེ།
en: these were a wall of lovely lion diamonds, a wall of undefeatable diamonds, a wall of powerfully penetrative diamonds, a wall of invincible diamonds, a strong wall of unimpedable, resolute diamonds, a wall that contained a network of the light rays of diamonds, and a wall of the array of the immaculate colors of diamonds.

source: རྡོ་རྗེ་རིན་པོ་ཆེའི་ར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་། ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མེད་པས་ཡོངས་སུ་སྤྲས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལན་ཀན་དང་། བ་སོ་མཛེས་པར་བཀྱེ་བ་དངུལ་རིན་པོ་ཆེའི་བ་སོ་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ།
en: All those great walls of precious diamonds were studded with countless precious jewels.

source: རིན་པོ་བཻཌཱུཪྻའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། རིན་པོ་ཆེ་ཤེལ་གྱི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། རིན་པོ་ཆེ་བྱི་རུའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། མུ་ཏིག་དམར་པོའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། མུ་ཏིག་རིན་པོ་ཆེ་རྒྱ་མཚོའི་སྙིང་པོའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ་སྟེ།
en: They were adorned with shining railings of Jambu River gold on which were strung strings of ivory beads, shining railings of silver jewels on which were strung strings of ivory beads, shining railings of beryl jewels on which were strung strings of ivory beads, shining railings of crystal jewels on which were strung strings of ivory beads, shining railings of coral jewels on which were strung strings of ivory beads, shining railings of red pearls on which were strung strings of ivory beads, and shining railings of pearl jewels, the essence of the oceans, on which were strung strings of ivory beads.

source: གྲོང་ཁྱེར་ཆེན་པོ་དེའི་སྒོ་ཆེན་པོ་བརྒྱད་ཀྱི་བར་བར་ན་ཡང་དཔག་ཚད་བཅུ་བཅུ་ཡོད་དོ།
en: The distance between each of the eight great gateways of the city was ten yojanas.

source: །སྒོ་དེ་དག་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་སྣ་ཚོགས་མཛེས་པར་བྱས་པ་སྟེ། བལྟ་ན་ཡིད་དུ་འོང་བའོ།
en: The gates were multicolored, beautifully made of the seven precious materials.

source: །གྲོང་ཁྱེར་ཆེན་པོ་དེ་ནི་དེ་ལྟར་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་ཡན་ལག་རྣམ་པར་བརྒྱད་དུ་རྣམ་པར་ཕྱེ་བ།
en: That great city was vast, huge, and divided into eight districts. The ground was made of blue beryl.

source: བཻཌཱུརྱ་སྔོན་པོའི་ས་ལ་གནས་པ་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་དེའི་ནང་ན་ཡང་སྲང་ཆེན་པོ་བྱེ་བ་ཕྲག་བཅུ་ཡོད་དེ། སྲང་རེ་རེའི་གློ་གཉིས་ནས་ཀྱང་ཁྱིམ་ཆེན་པོ་བརྒྱ་ཕྲག་སྟོང་སྟོང་མཁོས་ལེགས་པར་འགྲིགས་པ་སྟེ།
en: There were a hundred million streets in that city, and on both sides of each street there were a hundred thousand well-built and arranged mansions in which many hundreds of billions of beings lived.

source: ཀུན་ཀྱང་རིན་པོ་ཆེ་སྣ་ཚོགས་ལས་བྱས་པ་དག་གོ །རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་དག་གོ རིན་པོ་ཆེའི་གདུགས་དང་རྒྱལ་མཚན་བསྒྲེང་བ་དང་། བ་དན་ཆེ་ཕྲ་དང་ལྡན་པ་དག་གོ །ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་དག་གོ །
en: All those houses were made of the seven precious materials, were adorned with an array of various jewels, had precious parasols and banners erected upon them, and were endowed with all requisites.

source: སེམས་ཅན་ཁྲག་ཁྲིག་དུ་མ་གནས་པ་དག་གོ །གྲོང་ཁྱེར་ཆེན་པོ་དེ་ཡང་ནོར་བུ་རིན་པོ་ཆེའི་ཁ་དོག་གྲངས་མྱེད་པའི་ཁང་པས་མཛེས་པར་བྱས་པ་སྟེ།
en: That great city was beautified by high buildings that had the countless colors of precious jewels:

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: There were countless kūṭāgāras of Jambu River gold, with an inconceivable array of jewels, covered in a network of strings of beryl jewels.

source: གྲངས་མྱེད་པ་དང་ལྡན་པའོ། །དངུལ་གྱི་ཁང་པ་བརྩེགས་པ་ལ་མུ་ཏིག་དམར་པོའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ། གྲངས་མྱེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of silver, with an inconceivable array of jewels, covered in a network of strings of red pearls.

source: །བཻ་ཌཱུརྱའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་མཛོད་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of beryl, with an inconceivable array of jewels, covered in a network of strings of a treasure of precious jewels.

source: །ཤེལ་གྱི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྙིང་པོ་ཡངས་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱ་ན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of crystal, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called abundant essence

source: །ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བའི་ཡིད་དུ་འོང་བའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་ཉི་མའི་སྙིང་པོའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མྱེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of jewels that delight beings, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called sunstones.

source: །རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་དཔལ་གྱི་འོད་ཟེར་གྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of sapphires, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called light rays of splendor jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་རྒྱ་མཚོའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྐར་མའི་འོད་གཟེར་གྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་བགྲངས་མྱེད་པ་དང་ལྡན་པའོ། །རིན་པོ་ཆེ་རྡོ་རྗེའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་གཞན་གྱིས་མི་ཐུབ་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མྱེད་པ་དང་ལྡན་པའོ། དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་ཁང་པ་བརྩེགས་པ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མནྡཱར་བས་ཀུན་ནས་ཁེབས་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་བ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of the precious jewel ocean of beings , with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called asterias. There were countless kūṭāgāras of diamonds, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called invincible banners . There were countless kūṭāgāras of yellow sandalwood, with an inconceivable array of jewels, covered in a network of divine coral tree flowers.

source: སྤོས་ཀྱི་རྒྱལ་པོ་མཚུངས་པ་མེད་པའི་ཁང་པ་བརྩེགས་པ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of the unequaled king of perfumes, with an inconceivable array of jewels, covered in a network of a variety of divine flowers.

source: །རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དེ་དག་རེ་རེ་ཞིང་ཡང་རིན་པོ་ཆེའི་ལན་ཀན་དུ་མས་བརྒྱན་པ། རིན་པོ་ཆེའི་སྟེགས་བུ་རིམ་པ་བདུན་གྱིས་བསྐོར་བ། རིན་པོ་ཆེའི་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་འཁོར་བར་འགྲིགས་པའོ།
en: Each of those precious houses was adorned with many precious rooftop railings, was encircled by seven levels of precious balconies, and had seven rows of precious palm trees arranged around it.

source: །རིན་པོ་ཆེའི་ལན་ཀན་དེ་དག་དང་། རིན་པོ་ཆེའི་དེ་ལ་དེ་དག་ཐམས་ཅད་དུ་འང་ཕན་ཚུན་རིན་པོ་ཆེའི་སྲད་བུའི་འབྲེལ་བའོ།
en: Precious strings connected all the precious rooftop railings and the precious palm trees.

source: །རིན་པོ་ཆེའི་སྲད་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བས་བརྒྱན་པའོ།
en: Lines of golden bells adorned all those precious strings.

source: །གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེའི་ཆུན་པོའི་ལྡ་ལྡི་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བྲེས་ཤིང་སྦྲེལ་བའོ། །རིན་པོ་ཆེའི་ཆུན་པོའི་ལྡ་ལྡི་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་མངོན་པར་སྦྱངས་པ་དག་སྟེ།
en: Hanging wreaths of flowers were fastened to all those golden bells, and a network of precious little spherical bells hung from all those wreaths of flowers.

source: དེ་ལྟར་གྲོང་ཁྱེར་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ནི་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་བའོ། །ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་བའོ། །རིན་པོ་ཆེའི་འབྲུའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །རྡོ་རྗེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །གོས་རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །མེ་ཏོག་གི་ཕྲེང་བའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ།
en: In that way, the entire great city was covered in countless networks of precious jewels, was covered in countless networks of precious bells and little spherical bells, was covered in countless networks of divine perfumes, was covered in countless networks of divine flowers, was covered in countless networks of precious spheres, was covered in countless diamond canopies, was covered in countless precious canopies, was covered in countless precious parasols, was covered in countless precious kūṭāgāra canopies, was covered in countless precious cloth canopies, and was covered in countless canopies of flower garlands.

source: རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་བཙུགས་ཤིང་བསྒྲེང་བ་སྟེ།
en: Precious parasols and banners had been erected throughout the great city.

source: གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་དེའི་དབུས་སུ། རྒྱལ་པོ་འོད་ཆེན་པོ་བཞུགས་པའི་ཕོ་བྲང་བརྩིགས་པ་འཁོར་ཀུན་ཏུ་དཔག་ཚད་བཞི་ཡོད་པ་སྟེ།
en: In the center of the great city of Suprabha was King Mahāprabha’s palace.

source: རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའོ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྟེགས་བུ་རིམ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ། །རིན་པོ་ཆེའི་དྲིལ་བུ་ཡིད་དུ་འོང་བའི་སྒྲ་སྙན་པར་འཁྲོལ་བའི་དྲ་བ་རིམ་བདུན་གྱི་སྒྲ་ཀུན་ནས་འབྱུང་བའོ། །རིན་པ་ཆེ་སྣ་བདུན་གྱི་ཏ་ལའི་འཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་བསྐོར་བའོ། །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པའི་རྒྱན་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའོ།
en: The palace was four yojanas wide on every side, was made of the seven precious materials, was encircled by seven levels of balconies, had seven levels of networks of precious little spherical bells that emitted a beautiful sound, was encircled by seven rows of palm trees made of the seven precious materials, and was adorned by an inconceivable hundred thousand kūṭāgāras made of various precious materials.

source: རྫིང་རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མ་ལས་བྱས་པ། གསེར་གྱི་གྲམ་པ་ཀུན་ཏུ་བཀྲམ་པ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ས་ཡོངས་སུ་གང་བ། ལྷ་རྫས་ཀྱི་ཨུཏ་པ་ལ་དང་། པད་མོ་དང་ཀུ་མུད་དང་མེ་ཏོག་པུན་ད་རི་ཀས་ཆུའི་སྟེང་ཀུན་ཏུ་ཡོག་པ།
en: It had pools made of a variety of precious materials, with bottoms covered in gold sand, filled with water that had the eight excellent qualities, and its surface was covered with blue lotuses, night lotuses, and white lotuses.

source: རིན་པོ་ཆེའི་མེ་ཏོག་དང་འབྲས་བུ་ཤིང་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: They were beautified by trees that had flowers and fruits of every kind of precious material.

source: ཕྱོགས་བཞི་ནས་རིན་པོ་ཆེའི་ཕ་གུས་བརྩིགས་པའི་ཐེམ་སྐས་རྣམ་པར་བཀྱེ་བ་ཅན་གྱིས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ་དང་ལྡན་པ།
en: On all four sides there were beautiful precious railings intersected by steps.

source: །ལྷ་རྫས་ཀྱི་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་འབྱིན་པའི་བྱ་བྲན་སྣ་ཚོགས་ཀྱི་སྒྲ་ཤིན་ཏུ་འབྱུང་བ་ཡོད་པ།
en: There were the divine, sweet, and melodious songs of flocks of birds.

source: ལྷའི་དབང་པོའི་ཕོ་བྲང་དང་འགྲན་པ་སྟེ། དེའི་དབུས་ན་རིན་པོ་ཆེ་འགྲོ་བ་ལ་སྣང་བའི་ཁང་པ་བརྩེགས་པ།
en: In the center of this palace, which rivaled that of Devendra, there was a precious kūṭāgāra that shone on beings.
